{
  "title": "Privacy Policy",
  "lastUpdated": "October 2025",
  "sections": [
    {
      "title": "Information We Collect",
      "content": "We collect information you provide directly to us, such as when you purchase our services, contact us for support, or communicate with us. This may include your name, email address, payment information, and any messages or files you share with us."
    },
    {
      "title": "How We Use Your Information",
      "content": "We use the information we collect to provide, maintain, and improve our services, process transactions, send you technical notices and support messages, and respond to your comments and questions."
    },
    {
      "title": "Photo and Data Security",
      "content": "All photos and personal data you share with us are strictly confidential and kept between you and our service. The pictures in our website had explicit authorization of the users. We do not share, sell, or distribute your photos or personal information to third parties. Your photos are used solely for the purpose of providing our AI dating profile optimization services and are deleted from our systems after the service is completed."
    },
    {
      "title": "Data Protection",
      "content": "We implement appropriate security measures to protect your personal information against unauthorized access, alteration, disclosure, or destruction. However, no method of transmission over the internet or electronic storage is 100% secure."
    },
    {
      "title": "Third-Party Services",
      "content": "We may use third-party services for payment processing and email communication. These services have their own privacy policies, and we encourage you to review them."
    },
    {
      "title": "Your Rights",
      "content": "You have the right to access, update, or delete your personal information. You may also opt out of certain communications from us. To exercise these rights, please contact us at getDatesWithAI@proton.me."
    },
    {
      "title": "Changes to This Policy",
      "content": "We may update this privacy policy from time to time. We will notify you of any changes by posting the new privacy policy on this page and updating the 'last updated' date."
    },
    {
      "title": "Contact Us",
      "content": "If you have any questions about this privacy policy, please contact us at getDatesWithAI@proton.me."
    }
  ]
}
