{
  "title": "What Our Customers Say",
  "subtitle": "Real results from real men who transformed their dating lives.<br>I hope to see you here next!",
  "reviews": [
    {
      "name": "Mike, 28",
      "location": "New York",
      "rating": 5,
      "text": "I went from getting maybe 2-3 matches per week to 15-20 matches. The AI photos look so natural, nobody can tell they're enhanced. Best investment I've made for my dating life.",
      "result": "3x more matches"
    },
    {
      "name": "David, 35",
      "location": "Los Angeles", 
      "rating": 5,
      "text": "I OWE THIS MAN MY LIFE. Ever since i broke up 2 years ago I was only having low quality ONS here and there. I hate taking photos and was too lazy to get it done. Dan helped me get back on track and now I'm seeing a girl for 1 month now :) Dan is a legend, highly recommended, thank you!!",
      "result": "2-3 dates per week"
    },
    {
      "name": "Alex, 24",
      "location": "Chicago",
      "rating": 5,
      "text": "I was skeptical about AI photos at first, but these look completely natural. My profile went from getting ignored to getting tons of likes. The method is ethical and effective.",
      "result": "5x more profile views"
    },
    {
      "name": "James, 31",
      "location": "Miami",
      "rating": 5,
      "text": "The profile review service was incredibly helpful. They identified exactly what was wrong with my photos and bio. Within a week, I had my first date in months.",
      "result": "First date in months"
    },
    {
      "name": "Ryan, 26",
      "location": "Seattle",
      "rating": 5,
      "text": "This isn't just about photos - it's about understanding how modern dating works. The guide taught me everything I needed to know about online dating in 2024.",
      "result": "Confident dating approach"
    },
    {
      "name": "Chris, 29",
      "location": "Austin",
      "rating": 5,
      "text": "I've tried other dating guides before, but this one actually works. The AI photo method is genius - it's like having a professional photographer without the cost.",
      "result": "Professional quality photos"
    }
  ]
}
