{
  "title": "Terms of Service",
  "lastUpdated": "October 2025",
  "sections": [
    {
      "title": "Acceptance of Terms",
      "content": "By accessing and using GetDatesWithAI services, you accept and agree to be bound by the terms and provision of this agreement. If you do not agree to abide by the above, please do not use this service."
    },
    {
      "title": "Service Description",
      "content": "GetDatesWithAI provides AI-powered dating profile optimization services, including but not limited to profile reviews, AI photo generation guidance, and dating advice through digital products and consultation services."
    },
    {
      "title": "User Responsibilities",
      "content": "You are responsible for ensuring that any photos or information you provide are your own or that you have the right to use them. You agree to use our services ethically and in accordance with dating app terms of service and community guidelines."
    },
    {
      "title": "Payment and Refunds",
      "content": "All payments are processed securely through third-party payment processors. Due to the digital nature of our products, we do not offer refunds. However, we provide email support to help you achieve results with our services."
    },
    {
      "title": "Intellectual Property",
      "content": "All content, materials, and intellectual property provided through our services are owned by GetDatesWithAI and are protected by copyright and other intellectual property laws. You may not reproduce, distribute, or create derivative works without permission."
    },
    {
      "title": "Limitation of Liability",
      "content": "GetDatesWithAI shall not be liable for any indirect, incidental, special, consequential, or punitive damages, including without limitation, loss of profits, data, use, goodwill, or other intangible losses resulting from your use of our services."
    },
    {
      "title": "Ethical Use",
      "content": "You agree to use our AI services ethically and responsibly. This includes not creating misleading or deceptive content, respecting others' privacy, and following all applicable laws and platform guidelines."
    },
    {
      "title": "Service Availability",
      "content": "We strive to provide reliable service but cannot guarantee uninterrupted access. We reserve the right to modify, suspend, or discontinue any part of our services at any time."
    },
    {
      "title": "Governing Law",
      "content": "These terms shall be governed by and construed in accordance with applicable laws, without regard to conflict of law principles."
    },
    {
      "title": "Contact Information",
      "content": "For questions about these terms, please contact us at getDatesWithAI@proton.me."
    }
  ]
}
